// Bбудовані стилі.
/*
 Важливо!
  - памʼятати що це завжди обʼєкт, тому CSS властивості записуються як ключ значення.
  - синтаксис длявластивостей які складаються з 2ох і більше слів записуються кемелКейсом (camelCase). 
  Напликлад textAlign/borderBorder/backgroundColor.
  - Якщо ми вкажем значення для властивості Number (в місцях де мова йде про розміри),
   це автоматично сприйматись як пікселі і 'px' буде додано в кінці.


  Рекомендації щодо використання: 
  - стилі мають більше однієї властивості? окреми змінна буде доречною (styles).
  - Окремий файл для стилів Header.css
  - Для зменшення помилок, варто завжди вказувати одиниці вимірювання і визначати вдастивості за допомогою стрічок.

*/

const Header = () => {
    return (
        <div style={{
            borderBottom: '1px solid #CCC',
            margin: '15px',
            textAlign: 'center',
        }}
         >
           <h1> TO DO list</h1>
           <p>Things I have to do to become FE engineer</p>
        </div>
    )
}
export default Header;